String textCard1 = 'У Вас в отделе проходит довольно важное совещание, '
    'которое ведет руководитель. Вдруг у него звонит мобильник, '
    'он слушает и говорит Вам: «Меня вызывает генеральный, '
    'Вы должны принять решение без меня». Руководитель уходит. '
    'Через минут 15–20 обсуждения становится ясно, '
    'что дискуссия зашла в тупик. Ваши действия?\n\n'
    '1) Устроить голосование\n\n'
    '2) Подождать руководителя\n\n'
    '3) Принять решение, опираясь на собственное мнение';

String textCard2 =
    'Один из торговых представителей по личным причинам халтурил '
    'в течение последнего квартала, в результате отдел не выполнил '
    'план. Проанализируйте ситуацию с позиции виновности и '
    'наказания участников.\n\n'
    '1) Виноват руководитель, так как это входит в его зону ответственности\n\n'
    '2) Виноват халтурщик, так как не выполнил свои обязанности\n\n'
    '3) Виноват отдел сотрудников, так как они не сообщили про невыполнение плана заранее';

String textCard3 =
    'Сравните руководителей двух подразделений: один из них всегда '
    'показывает очень высокие личные результаты, а у другого '
    'личные результаты не выше всех, но средний показатель '
    'сотрудников его отдела выше.\n\n'
    '1) Первый руководитель более ценный для компании\n\n'
    '2) Второй руководитель более ценный для компании\n\n'
    '3) Оба человека не подходят на должность руководителя';

String textCard4 =
    'Руководитель находится со своим подчиненным на двойном визите. '
    'В какой-то момент он понимает, что может вмешаться и сделать '
    'презентацию вместо сотрудника. Это будет более эффектно, '
    'хотя существенного воздействия на результат встречи не '
    'окажет. Как должен поступить руководитель в такой ситуации?\n\n'
    '1) Вмешаться и провести презентацию за сотрудника\n\n'
    '2) Не вмешиваться и дать сотруднику закончить презентацию\n\n'
    '3) Незаметно подсказать сотруднику, как улучшить некоторые моменты';

String textCard5 = 'Что лучше: когда в спортивной команде есть яркая звезда, '
    'но сама команда не занимает призовых мест или когда команда '
    'входит в призеры, но никто особенно не выделяется?\n\n'
    '1) Первый вариант\n\n'
    '2) Второй вариант\n\n'
    '3) Не знаю';

String textCard6 = 'Что важнее и правильнее: видеть в людях достоинства или '
    'недостатки?\n\n'
    '1) Обоснование достоинств\n\n'
    '2) Осуждение недостатков\n\n'
    '3) Не знаю';

String textCard7 = 'Ситуация. Вы руководитель отдела. Вашему подразделению '
    'необходимо в ближайшие выходные выйти на работу, так как сложилась '
    'форс-мажорная ситуация. Политика организации и бюджет не '
    'позволяют оплачивать переработки. Кроме того, Вы знаете, '
    'что последнее время Ваши сотрудники работали очень напряженно. '
    'Ваши действия?\n\n'
    '1) Вывод сотрудников в обязательном порядке через стимуляцию\n\n'
    '2) Вывод сотрудников в обязательном порядке через мотивацию\n\n'
    '3) Не выводить сотрудников на работу в выходные. Никак.';

String textCard8 =
    'Вы руководитель. Идет обсуждение достаточно важного вопроса в ходе совещания '
    'внутри отдела. Ваш коллега высказывает точку зрения,'
    'которая противоречит Вашей. Ваши действия?\n\n'
    '1) Объяснить коллеге, что ваше мнение более весомо\n\n'
    '2) Выслушать коллегу и найти компромисс\n\n'
    '3) Принять сторону коллеги, чтобы он нес ответственность';

String resultText1 =
    'Готовность взять на себя ответственность за коллектив\n\n'; //О

String resultText2 =
    'Готовность отвечать за коллективный результат даже в случае провала\n\n'; //О

String resultText3 = 'Предпочтение общего результата личному\n\n'; //Р

String resultText4 = 'Позитивное отношение к людям\n\n'; //Р

String resultText5 = 'Обучаемость, стремление развиваться\n\n'; //Р

String resultText6 = 'Отсутствие страха перед сильными подчиненными\n\n'; //С

String resultText7 = 'Умение и готовность вдохновлять\n\n'; //Р

String resultText8 = 'Умение воспринимать точку зрения других\n\n'; //С

String resultText9 = 'Готовность и способность учить других\n\n'; //Р

String resultText10 = 'Умение организовать других\n\n'; //О

String resultText11 = 'Умение обосновать собственную точку зрения\n\n'; //С

String resultText12 = 'Готовность к нестандартным решениям\n\n'; //О

String resultText13 =
    'Отсутствие стремления самоутверждаться за счет других\n\n'; //Р

String globalResultText1 = 'Вы недостаточно компетентный управленец';

String globalResultText2 =
    'Ваши навыки соответствуют среднему уровню управленца. Развивайте свой потенциал';

String globalResultText3 =
    'Вас можно охарактеризовать как отличного управленца и эксперта в сфере HR';
